app/views/stores/storepage.html.erb

SELECT "items".* FROM "items" WHERE "items"."store_id" = ?  [["store_id", 1]]
---
                <div class="card", style="width:20vw; text-align:left; margin : 16px ">
                  <% @curItem = Item.find_by("id":x) %>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    <% @allcomment.each do |comment| %>
      <% @cuid = User.find(comment.user_id) %>