app/views/users/track.html.erb

  <p class="card-text">
  <% @oitem = Item.find(record[1]) %>
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]