app/views/users/vieworder.html.erb

<% @allrecord.each do |record| %>
  <% @item = Item.find(record[0]) %>
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]