app/controllers/stores_controller.rb

  def create
    @store = Store.new(store_params)

    respond_to do |format|
      if @store.save
---
INSERT INTO "stores" ("name", "password_digest", "address", "joindate", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def incitem
    @found = false
    Bucketlib.where("user_id": session[:user_id]).ids.each do |bucketlibid|
      if Bucketitem.find_by("item_id":params[:item_id],"bucketlib_id":bucketlibid) != nil
        @newquan = Bucketlib.find_by("id":bucketlibid).quantity + 1
        Bucketlib.find_by("id":bucketlibid).update("user_id": session[:user_id],"quantity":@newquan)
        @found = true
      end
    end
    if @found == false
      tmp = Bucketlib.create("user_id":session[:user_id],"quantity":1)
      Bucketitem.create("item_id":params[:item_id],"bucketlib_id":tmp.id)
    end
    @sid = Item.find_by("id":params[:item_id]).store_id
    @sname = Store.find(@sid).name
---
SELECT "bucketlibs".* FROM "bucketlibs" WHERE "bucketlibs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "bucketlibs" ("user_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["quantity", 1], ["created_at", "2021-12-13 07:59:02.796325"], ["updated_at", "2021-12-13 07:59:02.796325"]]
INSERT INTO "bucketitems" ("item_id", "bucketlib_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["item_id", 1], ["bucketlib_id", 2], ["created_at", "2021-12-13 07:59:02.871349"], ["updated_at", "2021-12-13 07:59:02.871349"]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def decitem
    Bucketlib.where("user_id": session[:user_id]).ids.each do |bucketlibid|
      if Bucketitem.find_by("item_id":params[:item_id],"bucketlib_id":bucketlibid) != nil
        @newquan = Bucketlib.find_by("id":bucketlibid).quantity - 1
        if @newquan > 0
          Bucketlib.find_by("id":bucketlibid).update("user_id": session[:user_id],"quantity":@newquan)
        elsif @newquan == 0
          tmp = Bucketlib.find_by("id":bucketlibid)
          Bucketitem.find_by("bucketlib_id":bucketlibid).destroy
          tmp.destroy
        end
      end
    end
    @sid = Item.find_by("id":params[:item_id]).store_id
    @sname = Store.find(@sid).name
---
SELECT "bucketlibs".* FROM "bucketlibs" WHERE "bucketlibs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "bucketitems".* FROM "bucketitems" WHERE "bucketitems"."item_id" = ? AND "bucketitems"."bucketlib_id" = ? LIMIT ?  [["item_id", 1], ["bucketlib_id", 2], ["LIMIT", 1]]
DELETE FROM "bucketitems" WHERE "bucketitems"."id" = ?  [["id", 980190963]]
DELETE FROM "bucketlibs" WHERE "bucketlibs"."id" = ?  [["id", 2]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def confirmpur
    @user = User.find_by(params[:user_id])
    @inbucket = []
  	@totalprice = 0
  	@bucketlibs = Bucketlib.where("user_id":session[:user_id])
  	@bucketlibs.each do |bucketlib|
  	  @bid = bucketlib.id
  	  @item_id = Bucketitem.find_by("bucketlib_id":@bid).item_id
---
SELECT "users".* FROM "users" WHERE (3) LIMIT ?  [["LIMIT", 1]]
SELECT "bucketlibs".* FROM "bucketlibs" WHERE "bucketlibs"."user_id" = ?  [["user_id", 3]]
SELECT "bucketitems".* FROM "bucketitems" WHERE "bucketitems"."bucketlib_id" = ? LIMIT ?  [["bucketlib_id", 2], ["LIMIT", 1]]

  def recordpur
    @newOrder = Order.create("purdate":Date.today,"user_id":session[:user_id])
    @orderID = @newOrder.id

    @store = Store.find_by(name: params[:name])
    @inbucket = []
    @totalprice = 0
    @bucketlibs = Bucketlib.where("user_id":session[:user_id])
    @bucketlibs.each do |bucketlib|
      @bid = bucketlib.id
      @item_id = Bucketitem.find_by("bucketlib_id":@bid).item_id
      @item_quantity = bucketlib.quantity
      @item_price = Item.find_by("id":@item_id).price
      Orderline.create("item_id":@item_id,"soldprice":@item_price,"quantity":@item_quantity,"order_id":@orderID)
    end

    Bucketlib.where("user_id": session[:user_id]).ids.each do |bucketlibid|
      Bucketitem.find_by("bucketlib_id":bucketlibid).destroy
---
INSERT INTO "orders" ("purdate", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["purdate", "2021-12-13"], ["created_at", "2021-12-13 08:05:52.294348"], ["updated_at", "2021-12-13 08:05:52.294348"], ["user_id", 3]]
SELECT "stores".* FROM "stores" WHERE "stores"."name" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "bucketlibs".* FROM "bucketlibs" WHERE "bucketlibs"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT "bucketitems".* FROM "bucketitems" WHERE "bucketitems"."bucketlib_id" = ? LIMIT ?  [["bucketlib_id", 2], ["LIMIT", 1]]
INSERT INTO "orderlines" ("item_id", "quantity", "soldprice", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["item_id", 1], ["quantity", 1], ["soldprice", 50], ["order_id", 3], ["created_at", "2021-12-13 08:05:52.320090"], ["updated_at", "2021-12-13 08:05:52.320090"]]
DELETE FROM "bucketitems" WHERE "bucketitems"."id" = ?  [["id", 980190963]]
DELETE FROM "bucketlibs" WHERE "bucketlibs"."id" = ?  [["id", 2]]

  def storepage
        @rating = Rating.new()
  	@store = Store.find_by(name: params[:name])
  	session[:view] = "seller"
  	@allItem = []
  	@store.items.each do |item|
  	  item.taglibs.each do |tag|
            tmp = [tag.tag_name,item.name,item.price,item.pic,item.id]
            @allItem.push(tmp)
  	  end
  	end
  	@allItem = @allItem.sort_by{ |tag| tag }
  	@prevtag = nil

  	if(session[:user_type] == "buyer")
  	  @inbucket = []
  	  @totalprice = 0
  	  @bucketlibs = Bucketlib.where("user_id":session[:user_id])
  	  @bucketlibs.each do |bucketlib|
  	    @bid = bucketlib.id
  	    @item_id = Bucketitem.find_by("bucketlib_id":@bid).item_id
  	    @item_quantity = bucketlib.quantity
  	   @inbucket.push([@item_id,@item_quantity])
  	    @totalprice += Item.find_by("id":@item_id).price * @item_quantity
          end

         @favlibid = User.find(session[:user_id]).favlib.id
         @favitem = Favitem.where("favlib_id":@favlibid).pluck("item_id")
       end
       @allcomment = Rating.where("store_id": @store.id)
---
SELECT "stores".* FROM "stores" WHERE "stores"."name" = ? LIMIT ?  [["name", "jj"], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."store_id" = ?  [["store_id", 1]]
SELECT "taglibs".* FROM "taglibs" INNER JOIN "itemtags" ON "taglibs"."id" = "itemtags"."taglib_id" WHERE "itemtags"."item_id" = ?  [["item_id", 1]]
SELECT "bucketlibs".* FROM "bucketlibs" WHERE "bucketlibs"."user_id" = ?  [["user_id", 3]]
SELECT "bucketitems".* FROM "bucketitems" WHERE "bucketitems"."bucketlib_id" = ? LIMIT ?  [["bucketlib_id", 2], ["LIMIT", 1]]
SELECT "favlibs".* FROM "favlibs" WHERE "favlibs"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "favitems"."item_id" FROM "favitems" WHERE "favitems"."favlib_id" = ?  [["favlib_id", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."store_id" = ?  [["store_id", 1]]

  def favitem
    if Favlib.find_by("user_id":session[:user_id]) == nil
      tmp = Favlib.create("user_id":session[:user_id])
      Favitem.create("item_id":params[:item_id],"favlib_id":tmp.id)
    elsif
      tmp = Favlib.find_by("user_id":session[:user_id])
      Favitem.create("item_id":params[:item_id],"favlib_id":tmp.id)
    end

    @store = Store.find_by(name: params[:name])
---
SELECT "favlibs".* FROM "favlibs" WHERE "favlibs"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
INSERT INTO "favitems" ("item_id", "favlib_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["item_id", 1], ["favlib_id", 3], ["created_at", "2021-12-13 07:55:36.642622"], ["updated_at", "2021-12-13 07:55:36.642622"]]
SELECT "stores".* FROM "stores" WHERE "stores"."name" = ? LIMIT ?  [["name", "jj"], ["LIMIT", 1]]

  def addcomment
    @sid = params[:rating][:store_id]
    @uid = params[:rating][:user_id]
    @score = params[:rating][:ratescore]
    @comment = params[:rating][:comment]
    Rating.create("comdate": Date.current,"ratescore":@score,"comment":@comment,"store_id":@sid,"user_id":@uid)
---
INSERT INTO "ratings" ("comdate", "ratescore", "comment", "user_id", "created_at", "updated_at", "store_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["comdate", "2021-12-13"], ["ratescore", 5.0], ["comment", "JOOOOJO"], ["user_id", 3], ["created_at", "2021-12-13 08:14:01.641707"], ["updated_at", "2021-12-13 08:14:01.641707"], ["store_id", 1]]

    def set_store
      @store = Store.find(params[:id])
---
SELECT "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]