app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "email", "name", "address", "phone", "gender", "birthdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", ""], ["LIMIT", 1]]
SELECT "stores".* FROM "stores" WHERE "stores"."name" = ? LIMIT ?  [["name", ""], ["LIMIT", 1]]
---
  def recieve_login_info
    @commit = params[:commit]
    @loginUsername = params[:user][:username]
    @loginPassword = params[:user][:password]
      if(@commit == 'Login')
        @usermatch = false
        @find = User.find_by(username:@loginUsername)
        @finds = Store.find_by(name:@loginUsername)

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "a"], ["LIMIT", 1]]
SELECT "favlibs".* FROM "favlibs" WHERE "favlibs"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
INSERT INTO "favlibs" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 3], ["created_at", "2021-12-13 07:51:53.256510"], ["updated_at", "2021-12-13 07:51:53.256510"]]
SELECT "favitems".* FROM "favitems" WHERE "favitems"."favlib_id" = ?  [["favlib_id", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "taglibs".* FROM "taglibs" INNER JOIN "itemtags" ON "taglibs"."id" = "itemtags"."taglib_id" WHERE "itemtags"."item_id" = ?  [["item_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "favitems"."item_id" FROM "favitems" WHERE "favitems"."favlib_id" = ?  [["favlib_id", 1]]
SELECT "bucketlibs".* FROM "bucketlibs" WHERE "bucketlibs"."user_id" = ?  [["user_id", 3]]
---
  def userpage
    @user = User.find_by(username: params[:username])
    session[:view] = "buyer"

    @allfav = []
    if Favlib.find_by("user_id":@user.id) == nil
      Favlib.create("user_id":@user.id)
    end
    @favitems = Favlib.find_by("user_id":@user.id).favitems
    @favitems.each do |favitem|
      favitem.item.taglibs.each do |tag|
        @tmp = [tag.tag_name,favitem.item.name,favitem.item.price,favitem.item.pic,favitem.item.id]
        @allfav.push(@tmp)
      end
    end
    @allfav = @allfav.sort_by{ |tag| tag }
    @favlibid = User.find(session[:user_id]).favlib.id
    @favitem = Favitem.where("favlib_id":@favlibid).pluck("item_id")

    @inbucket = []
  	@totalprice = 0
  	@bucketlibs = Bucketlib.where("user_id":session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 3]]
SELECT "orderlines".* FROM "orderlines" WHERE "orderlines"."order_id" = ?  [["order_id", 3]]
---
  def track
    @allrecord = []
    @user = User.find(session[:user_id])
    @allOrder = Order.where("user_id":@user.id)
    @allOrder.each do |order|
      @orderID = order.id
      @allOrderline = Orderline.where("order_id":@orderID)

SELECT "orderlines".* FROM "orderlines" WHERE "orderlines"."order_id" = ?  [["order_id", 3]]
---
  def vieworder
    @allrecord = []
    @orderID = params[:order_id]
    @allOrderline = Orderline.where("order_id":@orderID)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:id])